{"url": "https://www.encyclopedia.com/", "title": "Encyclopedia.com | Free Online Encyclopedia", "content": "Encyclopedia.com | Free Online Encyclopedia       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  The World’s #1 Online EncyclopediaSearch over 200 individual encyclopedias and reference books from the worlds most trusted publishers.           Read more about our content and why so many people love it.Picks of the weekLook who's using encyclopedia.comTop universities and institutions use encyclopedia.com every day for their research.  Recently researched aboutPandemic Flu Read Here  Recently researched aboutBacteriophages Read Here  Recently researched aboutThe Anglerfish Read Here  Taxationincome taxincome tax assessment levied upon individual or corporate incomes.   Pathologyautismautism , developmental disability resulting from a neurological disorder that affects the normal functioning of the brain.   BuddhismPure Land BuddhismPure Land Buddhism or Amidism, devotional sect of Mahayana Buddhism in China and Japan, centering on worship of the Buddha Amitabha.   U.S. HistoryBoston Tea PartyBoston Tea Party 1773.   Explorers, Travelers, and Conquerors: BiographiesHernan CortesHernán Cortés or Hernando Cortez , 1485-1547, Spanish conquistador , conqueror of Mexico.   French and Benelux Physical GeographyPyreneesPyrenees , Span. Pirineos, Fr. More topics environmentalism surrogate mother education martial arts Barcelona Best Online Consumer Information ServiceAward winner 2009 / 2010  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/earth-and-environment", "title": "Earth and the Environment Category | Encyclopedia.com", "content": "Earth and the Environment Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       Earth and the EnvironmentEarth and the Environment    earth. Wikimedia Commons (Public Domain)    atmosphere. Wikimedia Commons (Public domain)    tornado. Wikimedia Commons (Public Domain)Want to learn about earth and the environment? You’ll find it all here. From the most basic descriptions of atmosphere and weather, to in-depth studies of the oceans, metallurgy and the sciences, this category includes both broad and specific information on a variety of topics. To start with, this category includes biographies and personal stories from some of the most treasured and noted scienti ... Read morests and scholars. We’re talking about more than just a few famous names. These biographies include Jacques Cousteau, Sir Henry Bessemer, and Sir George Everest. The category also covers ecology and environmentalism, so beyond just learning about the environment, you’ll see how people around the world are working to protect it. You’ll find this content and more throughout the category.The earth and the environment category also includes detailed descriptions of terms and concepts so you can learn how dew is created, the difference between el niño or la niña, what a “horse latitude” is, and the names of all varieties of weather. And it’s more than just terms about weather. It also covers content about bauxite, alloys, quarrying, divining rods, the Fischer-Trompsch process, and the Mother Lode.With pages of information about geology and mining, the category also includes what’s happening inside the earth – instead of just on it. We also include information about Oceanography and other subjects like paleontology, mineralogy, and crystallography.These are just a few highlights from this category. Explore below and see the rest of the story of earth and the environment.Atmosphere and WeatherBiographiesEcology and EnvironmentalismGeographyGeology and OceanographyMinerals, Mining, and Metallurgy Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/history", "title": "History Category | Encyclopedia.com", "content": "History Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       HistoryHistory    Statue of Liberty. Other (Public Domain)    sphinx. Wikimedia Commons (Jonik, CC)Few other categories or areas of study offer as rich or as diverse a range of topics as history. Starting with ancient Greece and their rise, our content follows the empires that followed their dominance. The rulers of Greece include Alexander the Great, the thinkers include Socrates and Plato, and the achievements of Greece include art and architecture that can still be seen today.The Roman Empi ... Read morere grew alongside Greece and soon became the dominant force in the region, and then the Western world. The Romans gave us roads, architecture, government, and an empire that stretched from England to Egypt and beyond. At the same time, great empires were starting in Asia, South America, Africa, and even Australia.If we head to Africa and Asia, we’ll learn the stories of the pyramids of Egypt and the Pharaohs who ruled the lands, and the dynasties that ruled China and Japan for centuries. These areas are also home to the birthplace of Christianity, Buddhism, and Islam. This category also covers the rich history of India, the legendary trading post of Timbuktu, the rest of the continent of Africa, and the Saudi Arabian Peninsula.In the Americas, you’ll hear the stories of the Aztecs, Mayans, and Cherokee. As well as the discovery of the New World, the birth and rise of the United States of America, and political struggles in Central America. Important biographies from throughout history include everyone from Henry the VIII and Julius Caesar, to Ronald Reagan and Adolf Hitler.Ancient Greece and RomeAsia and AfricaAustralia, New Zealand, and the PacificBiographiesHistorians and ChroniclesLatin America and the CaribbeanModern EuropeUnited States and Canada Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/literature-and-arts", "title": "Literature and the Arts Category | Encyclopedia.com", "content": "Literature and the Arts Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       Literature and the ArtsLiterature and the Arts    Pierre Auguste Renoir. Wikimedia Commons (Public Domain)    William Shakespeare. Wikimedia Commons (Public Domain)    modern architecture. Wikimedia Commons (J. Crocker)If people can create it, you’ll probably find it in this category. Literature and the arts spans everything from writing books, designing buildings, sculpting stone, and painting on a canvas, to designing fashion, writing an article, and acting in a play. From the first cave paintings to modern works in the digital age, it’s always been about communication and expression.The subcategory of art an ... Read mored architecture covers American artists like Andy Warhol, Horace Pippin, and Jackson Pollock. It also includes European and Asian Artists like Michelangelo, Leonardo DaVinci, Paul Cezanne, and Piet Mondrian. Ranging from The Guggenheim to the Louvre to MoMA, museums displaying these pieces of art can be found around the world. Architecture covers the designers of great buildings, bridges, and roads. We have content about architects from Phillip Johnson to Frank Lloyd Wright to Ictinus, the designer of the Parthenon. English Literature can cover a range from Chaucer and Shakespeare, to Charles Dickens and Truman Capote. We also have extensive information about Asian, French, German, and Italian Literature.The category of Literature and the Arts also includes fashion, design, and crafts. This could cover designing and making clothing, conducting interior design, and working on arts and crafts. These could include hobbies like embroidery, knitting, quilting, and basketry. The beginning of journalism can be traced back to the Acta Diuma, the prototype of the modern newspaper. Today, journalism includes newspapers, magazines, Web sites, and even comic strips.Other areas of literature and the arts can include dance, film, theater, and music. All have rich histories that you can explore below.Art and ArchitectureBiographiesClassical Literature, Mythology, and FolkloreFashion, Design, and CraftsJournalism and PublishingLanguage, Linguistics, and Literary TermsLiterature in EnglishLiterature in Other Modern LanguagesPerforming ArtsScholars and Historians Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/medicine", "title": "Medicine Category | Encyclopedia.com", "content": "Medicine Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       MedicineMedicine    hemoglobin. Wikimedia Commons (Reytan, GFDL)    nervous system. Wikimedia Commons (Public Domain)    heart. Wikimedia Commons (Ewen, CC)The history of medicine can be traced back as far as Neolithic man, but our understanding of medicine began with the Sumerians. Our knowledge of anatomy began with the Greeks, but truly took hold during the Middle Ages. Modern medicine can be traced back to discoveries made in the 17th century. That’s when William Harvey demonstrated the circulation of blood in the body, quinine was used to treat  ... Read moremalaria, the compound microscope was developed, and the capillary system was discovered.Today, we’ve built on many of those early discoveries in our understanding of cell biology, genetics and microbiology. Research today focuses on preventing diseases like heart disease, tuberculosis, and AIDS, while also discovering cures and treatments for cancer. We also have a greater understanding of pathogens, or microorganisms, like bacteria and viruses that cause most diseases. The genome project is also helping us understand disease and the human body on a genetic level and led to genetic engineering, which is used to develop pharmaceuticals and new approaches to cancer treatment.Modern medicine also has given us pharmacology, allowing medical professionals to treat a host of diseases. From acetaminophen, which can treat a headache, to immunosuppressive drugs, which aid in organ transplantation, this growing field offers a multitude of new and effective drugs. Psychology and psychiatry have also changed much since these sciences first began. People with disorders were often cast away from society or, later, placed in asylums and not treated. Today, psychiatry involves the treatment of many disorders and can involve both physiological and psychological treatments. Anatomy and PhysiologyDiseases and ConditionsDivisions, Diagnostics, and ProceduresDrugsPsychology Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/people", "title": "People Category | Encyclopedia.com", "content": "People Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       PeoplePeople    Martin Luther King Jr.. Wikimedia Commons (Public Domain)    Abraham Lincoln. Wikimedia Commons (Public Domain)   The accomplishments of people are documented throughout this category. We have the stories of historical figures like Lewis and Clark, who attempted to find the Northwest Passage and instead discovered much of the Great Plains. We also have the stories of Amelia Earhart, Pontius Pilate, and Sitting Bull.In the area of literature and the arts, you’ll find the stories of authors, actors, dancers, p ... Read moreainters, and sculptors. This includes stories about James Joyce, Jackson Pollock, Mikhail Baryshnikov, and Charlie Chaplin.The history of medicine is also filled with important and amazing people. It started with Hippocrates, the inspiration behind the Hippocratic oath, and also includes Jonas Salk, the man who developed the polio vaccine, and Florence Nightingale, the founder of modern nursing.Religions and philosophies are based on the lives, stories, and teachings of some amazing people – just a few are Buddha, Mohammad, Jesus Christ, and Confucius. Also, people who followed these religions have led amazing lives like Dr. Martin Luther King, Jr. and Mahatma Gandhi.The world of science and technology is also rich with stories of amazing inventors, researchers, scholars, and thinkers. This include Charles Babbage, who proposed and attempted to build the first computer, Steve Jobs and Steve Wozniak, who founded and built Apple Computer, and Eli Whitney, who invented the cotton gin.From Louis Leakey to the first justices of the U.S. Supreme Court, there are many stories of important and influential people in social sciences and the law. In the area of sports and games, important names include Abner Doubleday, the inventor of baseball, Ivan Lendl, a tennis star, and Paavo Nurmi, a Finnish track star.Explore more stories about people below.Food and DrinkHistoryLiterature and the ArtsMedicinePhilosophy and ReligionScience and TechnologySocial Sciences and the LawSports and Games Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/philosophy-and-religion", "title": "Philosophy and Religion Category | Encyclopedia.com", "content": "Philosophy and Religion Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       Philosophy and ReligionPhilosophy and Religion    Saint Genevieve. Wikimedia Commons (Public Domain)    Islam. Wikimedia Commons (Ali Imran, CC)    Torah. Wikimedia Commons (Horsch Willy, GFDL)Throughout history, philosophy and religion have played a significant role in the development of a society, how it treats outsiders, and how it treats its own members. Humans have frequently looked to gods or deities to lead them and to answer some of life’s mysteries.The Romans and the Greeks were led by a group of deities who shared many of the same traits and powers. The Greeks thought that th ... Read moree gods Zeus, Hades, and Poseidon were the supreme lords of the sky, the underworld, and the waters. These and other gods had supernatural powers, but were limited in their powers by Moira, or fate, which was the force of destiny. The gods often fought against each other and meddled in human affairs.The three main Western religions of Islam, Judaism, and Christianity can all trace their beginnings to the story of Abraham in The Bible. Today, there are more than 1 billion Muslims, more than 1 billion Christians and millions of Jewish people around the world. The ongoing struggle in the Middle East can be traced, in part, to the conflicts between these three religious groups. The Crusades, the creation of the state of Israel in 1948, and other events in history have created tension and led to conflict between the three groups. Philosophy and religion are also practiced throughout Asia, with Buddhism, Confucianism, Hinduism, and Shinto found in India, parts of China, Japan, and other areas. Philosophy is usually divided into the branches of metaphysics, logic, epistemology, ethics, and aesthetics. They all help followers study the ultimate reality, causes, and principles that lie under being and thinking. Ancient ReligionsChristianityEastern ReligionsIslamJudaismOther Religious Beliefs and General TermsPhilosophyThe Bible Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/places", "title": "Places Category | Encyclopedia.com", "content": "Places Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       PlacesPlaces    Mount Everest. Wikimedia Commons (Che, CC)    Sahara. Wikimedia Commons (Holger Reineccius, GFDL)Where in the world is this category? Everywhere. There are places on the planet where one can see geysers, glaciers, deserts, mountains, rain forests, and oceans. Starting in Africa, you’ll discover the world’s longest river, the Nile, as well as the world’s largest desert, the Sahara. The legendary trading post of Timbuktu is located in the middle of this desert. Throughout the rest of the contin ... Read moreent you’ll find a diverse range of cultures, countries, cities, and people.Asia is the world’s most populous continent and contains the countries of the former Soviet Union along with others including China, India, Japan, and Turkey. This vast continent stretches from the Arctic Circle to the equator and contains the world’s tallest mountain, Mt. Everest, as well as the world’s lowest point, the Dead Sea.Sometimes considered a peninsula of the Eurasian landmass, Europe has a climate that ranges from subtropical to polar and includes mountain ranges like the Alps and the Pyrenees. It is also the birthplace of Western civilization and home to cities like London, Paris, Gdansk, Stockholm, and Lisbon. Europe was also the main theater of conflict for World War I and also for much of World War II.In North and South America, you’ll find places ranging from the Grand Canyon and Yellowstone National Park, to the Amazon Rain Forest and the Andes Mountains. North America is home to the United States, Mexico, and Canada. South America is where one can find the cities of Rio de Janeiro, Montevideo, Santiago, and Caracas.Australia is the only continent that holds only one country while Antarctica is the only continent that doesn’t contain any countries. These are just a few of the places you’ll be able to explore below.AfricaAsiaAustralia and OceaniaBritain, Ireland, France, and the Low CountriesCommonwealth of Independent States and the Baltic NationsGermany, Scandinavia, and Central EuropeLatin America and the CaribbeanOceans, Continents, and Polar RegionsSpain, Portugal, Italy, Greece, and the BalkansUnited States and Canada Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/plants-and-animals", "title": "Plants and Animals Category | Encyclopedia.com", "content": "Plants and Animals Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       Plants and AnimalsPlants and Animals    zebra. Wikimedia Commons (Lukas Kaffer, GFDL)    mushroom. Wikimedia Commons (MichaelMaggs, CC)The surface of the earth is covered with plants and animals, and we cover many of them in this category. Starting with plants, we explore agriculture and horticulture. Agriculture is the science of producing plants and livestock from the natural resources of the earth. This usually happens on a large scale. Horticulture usually means small-scale gardening and cultivating fruits, vegetables, flower ... Read mores, and ornamental plants.Both grew from early man’s need to feed and clothe themselves, and agriculture and the domestication of wild animals made it possible for civilizations to be created. Today, modern agriculture feeds most of the people on the planet and is made easier by developments like irrigation, genetic engineering, and the combine harvester. Diseases that typically infect plants are blight, clubroot, gall, and viroid. People who made important contributions to the advancement of agriculture as a science include Jethro Tull, who invented a mechanical drill for sowing seeds, and Eli Whitney, who invented the cotton gin.Animals, both domesticated and wild, can be found almost anywhere on the planet. Domesticated animals include cattle, horses, sheep, chickens, dogs, llamas, and pigs. The rest of the creatures on the planet are considered wild animals, and this includes mammals, insects, fish, and reptiles. Many varieties of animals can be found in all corners of the globe, deep in the sea, and soaring high in the sky. The study of all animals is called zoology and it includes the classification and naming systems as well as studying fossil records.The category of plants and animals contains information about many living things on earth. Continue exploring to learn more.Agriculture and HorticultureAnimalsBiographiesBotanyMicrobes, Algae, and FungiPlantsZoology and Veterinary Medicine Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/science-and-technology", "title": "Science and Technology Category | Encyclopedia.com", "content": "Science and Technology Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       Science and TechnologyScience and Technology    Andromeda Galaxy. Wikimedia Commons (Public Domain)    Galileo. Wikimedia Commons (Public Domain)Science and technology is quite a broad category, and it covers everything from studying the stars and the planets to studying molecules and viruses. Beginning with the Greeks and Hipparchus, continuing through Ptolemy, Copernicus and Galileo, and today with our work on the International Space Station, man continues to learn more and more about the heavens.From here, we look inward to biochemistr ... Read morey and biology. To truly understand biochemistry, scientists study and see the unseen by studying the chemistry of biological processes. This science, along with biophysics, aims to bring a better understanding of how bodies work – from how we turn food into energy to how nerve impulses transmit.Chemistry is a science that explains how salt, something on every table in the world, can be made from sodium and chlorine, two elements that are poisonous to humans. From its beginnings, when Aristotle defined the existence of the atom, to modern chemistry, which combines atomic theory and organic chemistry, this field continues to advance our lives.In technology, you’ll find many of the things that make life easier today. This includes medical advances like MRI machines, fuel-efficient transportation, portable computing devices, and flat screen televisions. Advances in the field of technology continue to amaze and astound. Modern computing technology is able to communicate wirelessly to the Internet and to other devices – advances that have freed computers from desks and made technology and information available to more and more people.Science and technology hold the answers to many of life’s questions.Astronomy and Space ExplorationBiochemistryBiographiesBiology and GeneticsChemistryComputers and Electrical EngineeringMathematicsPhysicsTechnology Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/social-sciences-and-law", "title": "Social Sciences and the Law Category | Encyclopedia.com", "content": "Social Sciences and the Law Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       Social Sciences and the LawSocial Sciences and the Law    reading. Wikimedia Commons (Bangladesh Blogger, CC)    John Paul Stevens. Wikimedia Commons (Public Domain)    Alexis de Tocqueville. Wikimedia Commons (Public domain)The category of social sciences and the law includes everything from anthropology and archeology to education and law. While its study often includes elements of archeology, anthropology covers the study of cultures, social relations, and human behaviors. Anthropologists and archeologists have studied the Aztecs to the Australopithecus, or early man, and have furthered our understanding of both.I ... Read moref money makes the world go around, then economics and business make money go around. From Andre Carnegie to Bill Gates, businesspeople have always been pioneers in innovation and in philanthropy. Economics, at its most basic level, is the study of supply and demand, and we see it in action every day at the world’s stock exchanges.Education, which continues to be available to more and more people, is the foundation of advanced civilization. The modern system of colleges and universities began around the 12th century as a way to achieve further training in law, theology, and medicine. Today, universities and other places of higher learning can be found in every country.The practice of law began around the time of the Magna Carta and today has created a system of justice that’s as varied as the countries and cultures of the world. This leads into another element of social sciences and the law, namely political science and government. Around the world, there are many political systems, from democracies to dictatorships. Sociology and social reform has continued to change the landscape of human rights and our understanding of how people interact. Leaders who fought for social reform include Dr. Martin Luther King, Jr. and Mahatma Gandhi. Anthropology and ArchaeologyBiographiesEconomics, Business, and LaborEducationLawPolitical Science and GovernmentSociology and Social Reform Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
{"url": "https://www.encyclopedia.com/sports-and-everyday-life", "title": "Sports and Everyday Life Category | Encyclopedia.com", "content": "Sports and Everyday Life Category | Encyclopedia.com       Skip to main content                    EXPLORE EXPLORE Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily       Sports and Everyday LifeSports and Everyday Life    wine. Wikimedia Commons (Aka, CC)    bowling. Other (Public Domain)    cheese. Wikimedia Commons (Ranveig, GFDL)    chess. Wikimedia Commons (Andre Riemann, GFDL)This category covers the things that people do in their spare time for fun and it includes activities that people enjoy as professionals. Sports and everyday life includes arts and crafts, customs, food, games, hobbies, interior design, and sports. It’s the category about the rest of our life.Content about arts and crafts begins with the kinds of things that we do around the home, in the yard and ... Read more for hobbies. This could include knitting, building models, making pottery, and gardening. Some of these arts and crafts could be decorative, functional, or both.Sports and everyday life also includes fashion. This covers designing and making clothes, as well as buying them. We’re talking about everything from buttons and corsets, to suits and dresses, to earrings and shoes.People need to eat and drink and we have content about all kinds of food and beverages. One of the world’s oldest alcoholic drinks is mead and one of the world’s most mysterious is absinthe. Formerly made with wormwood, absinthe is banned due to its toxicity. Food could include everything we eat for breakfast, lunch, dinner, and midnight snacks. This includes cakes and doughnuts, fresh fruit, steaks, soups, and just about anything you can eat.Professionals and amateurs play sports around the world. Some kinds of sports include soccer, basketball, American football, cricket, and baseball. Sports can be played in all seasons, and both outdoors and inside. Legendary names from the world of sports include Muhammad Ali, Michael Jordan, Pelé, Nadia Comaneci and David Beckham.Explore more about sports and everyday life below.Crafts and Household ItemsDays and HolidaysFashion and ClothingFood and DrinkGamesSocial OrganizationsSports Research Categories Earth and Environment History Literature and the Arts Medicine People Philosophy and Religion Places Plants and Animals Science and Technology Social Sciences and the Law Sports and Everyday Life Additional References Articles Daily  Footer menu Home About Us Help Site Feedback Privacy & Cookie Policy Terms and Conditions Daily © 2019 Encyclopedia.com | All rights reserved."}
